# SETUP

- Connect to the local MySQL database
- Set display limit of queries
- Drop views if they exist

In [1]:
%load_ext sql

In [2]:
from sqlalchemy import create_engine

db_name = "Chinook_AutoIncrement"
db_host = "localhost"
db_username = "valenatherese"
db_password = "password"

engine = create_engine(f"mysql://{db_username}:{db_password}@{db_host}/{db_name}")
%sql engine

In [3]:
%config SqlMagic.displaylimit = 15

In [4]:
%%sql
DROP VIEW IF EXISTS unsold_tracks_view;
DROP VIEW IF EXISTS total_tracks_view;
DROP VIEW IF EXISTS YEARLY_TOP;

Running query in 'mysql://valenatherese:***@localhost/Chinook_AutoIncrement'

++
||
++
++

# CUSTOMER RELATIONS AND SALES

### Employee Information

Show detailed information about employees by deriving columns

In [5]:
%%sql
SELECT  EmployeeId,
        CONCAT_WS(' ',FirstName, LastName) AS Name,
        YEAR(HireDate) AS Hired,
        FLOOR(DATEDIFF(CURRENT_DATE, HireDate)/365) AS CompanyStay,
        FLOOR(DATEDIFF(CURRENT_DATE, BirthDate)/365) AS Age,
        FLOOR(DATEDIFF(HireDate, BirthDate)/365) AS AgeJoined     
FROM employee

Running query in 'mysql://valenatherese:***@localhost/Chinook_AutoIncrement'

8 rows affected.

+------------+------------------+-------+-------------+-----+-----------+
| EmployeeId |       Name       | Hired | CompanyStay | Age | AgeJoined |
+------------+------------------+-------+-------------+-----+-----------+
|     1      |   Andrew Adams   |  2002 |      21     |  62 |     40    |
|     2      |  Nancy Edwards   |  2002 |      22     |  65 |     43    |
|     3      |   Jane Peacock   |  2002 |      22     |  50 |     28    |
|     4      |  Margaret Park   |  2003 |      21     |  76 |     55    |
|     5      |  Steve Johnson   |  2003 |      20     |  59 |     38    |
|     6      | Michael Mitchell |  2003 |      20     |  50 |     30    |
|     7      |   Robert King    |  2004 |      20     |  54 |     33    |
|     8      |  Laura Callahan  |  2004 |      20     |  56 |     36    |
+------------+------------------+-------+-------------+-----+-----------+

### Employee Performance (Sales Amount)
Show the total sales of employees

In [6]:
%%sql
SELECT
    e.EmployeeId AS ID,
    CONCAT_WS(' ',e.FirstName, e.LastName) AS EMPLOYEE,
    SUM(i.Total) AS TOTAL_SALES

FROM Employee AS e
INNER JOIN Customer c
    ON c.SupportRepId = e.EmployeeId
INNER JOIN  Invoice i
    ON i.customerId = c.customerId

GROUP BY e.EmployeeId
ORDER BY TOTAL_SALES DESC;

Running query in 'mysql://valenatherese:***@localhost/Chinook_AutoIncrement'

3 rows affected.

+----+---------------+-------------+
| ID |    EMPLOYEE   | TOTAL_SALES |
+----+---------------+-------------+
| 3  |  Jane Peacock |    833.04   |
| 4  | Margaret Park |    775.40   |
| 5  | Steve Johnson |    720.16   |
+----+---------------+-------------+

### Employee Performance (Customers Handled)
Show the number of clients that each employee has handled

In [7]:
%%sql
SELECT 
    e.EmployeeId AS ID,
    CONCAT_WS(' ',e.FirstName, e.LastName) AS EMPLOYEE,
    count(customerid) AS CLIENTS
FROM employee AS e
INNER JOIN customer
    ON customer.supportrepid = EmployeeId
GROUP BY e.EmployeeId
ORDER BY CLIENTS desc;

Running query in 'mysql://valenatherese:***@localhost/Chinook_AutoIncrement'

3 rows affected.

+----+---------------+---------+
| ID |    EMPLOYEE   | CLIENTS |
+----+---------------+---------+
| 3  |  Jane Peacock |    21   |
| 4  | Margaret Park |    20   |
| 5  | Steve Johnson |    18   |
+----+---------------+---------+

### Top Spending Customers That Have Spent Over 45
Together with the customer's support representative

In [8]:
%%sql
SELECT 
    RANK() OVER(ORDER BY SUM(Total) DESC) AS CUS_RANK,
    SUM(Total) AS TOTAL_SPENT,
    CONCAT_WS(' ',c.FirstName, c.LastName) AS CUSTOMER,
    c.Country AS COUNTRY,
    CONCAT_WS(' ',e.FirstName, e.LastName) AS SUPPORT_REP
FROM customer c
INNER JOIN invoice i
    ON i.customerid = c.customerid
INNER JOIN employee e
    ON e.EmployeeId = c.SupportRepId
GROUP BY c.FirstName, c.LastName, e.FirstName, e.LastName, c.Country
HAVING TOTAL_SPENT > 40
ORDER BY TOTAL_SPENT DESC;

Running query in 'mysql://valenatherese:***@localhost/Chinook_AutoIncrement'

14 rows affected.

+----------+-------------+-----------------------+----------------+---------------+
| CUS_RANK | TOTAL_SPENT |        CUSTOMER       |    COUNTRY     |  SUPPORT_REP  |
+----------+-------------+-----------------------+----------------+---------------+
|    1     |    49.62    |      Helena Holý      | Czech Republic | Steve Johnson |
|    2     |    47.62    |   Richard Cunningham  |      USA       | Margaret Park |
|    3     |    46.62    |       Luis Rojas      |     Chile      | Steve Johnson |
|    4     |    45.62    |     Hugh O'Reilly     |    Ireland     |  Jane Peacock |
|    4     |    45.62    |    Ladislav Kovács    |    Hungary     |  Jane Peacock |
|    6     |    43.62    |    Fynn Zimmermann    |    Germany     |  Jane Peacock |
|    6     |    43.62    |     Frank Ralston     |      USA       |  Jane Peacock |
|    6     |    43.62    |     Julia Barnett     |      USA       | Steve Johnson |
|    9     |    42.62    |     Victor Stevens    |      USA       | Steve Johnson |
|    9     |    42.62    |     Astrid Gruber     |    Austria     | Steve Johnson |
|    11    |    41.62    |    Terhi Hämäläinen   |    Finland     |  Jane Peacock |
|    12    |    40.62    |    Isabelle Mercier   |     France     |  Jane Peacock |
|    12    |    40.62    | František Wichterlová | Czech Republic | Margaret Park |
|    12    |    40.62    | Johannes Van der Berg |  Netherlands   | Steve Johnson |
+----------+-------------+-----------------------+----------------+---------------+

# HIGHEST BILLED COUNTRY

Group the customers by country then order by each country's total bill. This displays the highest billed countries and other details of their spending
* `TOTAL_BILLED` is the total bill of that country
* `BILL_COUNT` is the total number of transactions of that country
* `AVG_BILL` is the average bill of the transactions in that country

In [9]:
%%sql
SELECT 
    DENSE_RANK() OVER(ORDER BY SUM(Total) DESC) - 1 AS 'RANK',
    CASE 
        WHEN GROUPING(Country) 
            THEN 'Total'
        ELSE Country
    END AS COUNTRY, 
    SUM(Total) AS TOTAL_BILLED,
    AVG(Total) AS AVG_BILL,
    COUNT(Total) AS BILL_COUNT
    
FROM customer
INNER JOIN invoice
    ON invoice.customerid = customer.customerid
GROUP BY Country
WITH ROLLUP 
ORDER BY TOTAL_BILLED DESC;

Running query in 'mysql://valenatherese:***@localhost/Chinook_AutoIncrement'

25 rows affected.

+------+----------------+--------------+----------+------------+
| RANK |    COUNTRY     | TOTAL_BILLED | AVG_BILL | BILL_COUNT |
+------+----------------+--------------+----------+------------+
|  0   |     Total      |   2328.60    | 5.651942 |    412     |
|  1   |      USA       |    523.06    | 5.747912 |     91     |
|  2   |     Canada     |    303.96    | 5.427857 |     56     |
|  3   |     France     |    195.10    | 5.574286 |     35     |
|  4   |     Brazil     |    190.10    | 5.431429 |     35     |
|  5   |    Germany     |    156.48    | 5.588571 |     28     |
|  6   | United Kingdom |    112.86    | 5.374286 |     21     |
|  7   | Czech Republic |    90.24     | 6.445714 |     14     |
|  8   |    Portugal    |    77.24     | 5.517143 |     14     |
|  9   |     India      |    75.26     | 5.789231 |     13     |
|  10  |     Chile      |    46.62     | 6.660000 |     7      |
|  11  |    Hungary     |    45.62     | 6.517143 |     7      |
|  11  |    Ireland     |    45.62     | 6.517143 |     7      |
|  12  |    Austria     |    42.62     | 6.088571 |     7      |
|  13  |    Finland     |    41.62     | 5.945714 |     7      |
+------+----------------+--------------+----------+------------+
Truncated to displaylimit of 15.

# TRACK SALES

### Unsold Tracks
Show the tracks that have not been sold

In [10]:
%%sql
SELECT DISTINCT 
    t.trackid AS TRACK_ID, 
    t.Name AS TITLE, 
    ar.name AS ARTIST, 
    al.Title AS ALBUM

FROM track AS t

INNER JOIN Album al
ON al.AlbumId = t.AlbumId
INNER JOIN Artist ar
ON ar.ArtistId = al.ArtistId

WHERE trackid NOT IN (SELECT DISTINCT trackid FROM invoiceline);

Running query in 'mysql://valenatherese:***@localhost/Chinook_AutoIncrement'

1519 rows affected.

+----------+--------------------------+-------------------+---------------------------------------+
| TRACK_ID |          TITLE           |       ARTIST      |                 ALBUM                 |
+----------+--------------------------+-------------------+---------------------------------------+
|    7     |     Let's Get It Up      |       AC/DC       | For Those About To Rock We Salute You |
|    11    |          C.O.D.          |       AC/DC       | For Those About To Rock We Salute You |
|    17    |    Let There Be Rock     |       AC/DC       |           Let There Be Rock           |
|    18    |      Bad Boy Boogie      |       AC/DC       |           Let There Be Rock           |
|    22    |    Whole Lotta Rosie     |       AC/DC       |           Let There Be Rock           |
|    23    |      Walk On Water       |     Aerosmith     |                Big Ones               |
|    27    | Dude (Looks Like A Lady) |     Aerosmith     |                Big Ones               |
|    29    |          Cryin'          |     Aerosmith     |                Big Ones               |
|    33    |      The Other Side      |     Aerosmith     |                Big Ones               |
|    34    |          Crazy           |     Aerosmith     |                Big Ones               |
|    35    |       Eat The Rich       |     Aerosmith     |                Big Ones               |
|    40    |         Perfect          | Alanis Morissette |           Jagged Little Pill          |
|    41    |    Hand In My Pocket     | Alanis Morissette |           Jagged Little Pill          |
|    45    |      Head Over Feet      | Alanis Morissette |           Jagged Little Pill          |
|    46    |        Mary Jane         | Alanis Morissette |           Jagged Little Pill          |
+----------+--------------------------+-------------------+---------------------------------------+
Truncated to displaylimit of 15.

### Artists With Unsold Tracks
Compare the total number of tracks and the total number of unsold tracks for each artist. This is done with views

###### Creating a view of artists and their number of unsold tracks:

In [11]:
%%sql
CREATE VIEW unsold_tracks_view AS
    SELECT 
        COUNT(t.trackid) AS Unsold_Tracks, 
        CASE 
            WHEN GROUPING(ar.name) 
                THEN 'Total'
            ELSE ar.name
        END AS Artist 
    FROM track AS t
    INNER JOIN Album al
        ON al.AlbumId = t.AlbumId
    RIGHT JOIN Artist ar
        ON ar.ArtistId = al.ArtistId
    WHERE trackid NOT IN (SELECT DISTINCT trackid FROM invoiceline)
    GROUP BY ar.name
    WITH ROLLUP
    ORDER BY Unsold_Tracks DESC;

Running query in 'mysql://valenatherese:***@localhost/Chinook_AutoIncrement'

++
||
++
++

In [12]:
%%sql
SELECT *
FROM unsold_tracks_view

Running query in 'mysql://valenatherese:***@localhost/Chinook_AutoIncrement'

171 rows affected.

+---------------+-----------------------+
| Unsold_Tracks |         Artist        |
+---------------+-----------------------+
|      1519     |         Total         |
|       90      |      Iron Maiden      |
|       52      |          Lost         |
|       51      |      Deep Purple      |
|       44      |           U2          |
|       37      |      Led Zeppelin     |
|       37      |       Pearl Jam       |
|       33      |       Metallica       |
|       32      |     Lenny Kravitz     |
|       31      |       The Office      |
|       29      |    Various Artists    |
|       26      |       Van Halen       |
|       24      |       Audioslave      |
|       24      |      Foo Fighters     |
|       24      | Red Hot Chili Peppers |
+---------------+-----------------------+
Truncated to displaylimit of 15.

###### Creating a view of artists and their total tracks available:

In [13]:
%%sql
CREATE VIEW total_tracks_view AS
SELECT DISTINCT 
    COUNT(t.trackid) AS Total_Tracks, 
    CASE 
        WHEN GROUPING(ar.name) 
            THEN 'Total'
        ELSE ar.name
    END AS Artist
FROM track AS t
INNER JOIN Album al
    ON al.AlbumId = t.AlbumId
RIGHT JOIN Artist ar
    ON ar.ArtistId = al.ArtistId
GROUP BY ar.name
WITH ROLLUP
ORDER BY Total_Tracks DESC;

Running query in 'mysql://valenatherese:***@localhost/Chinook_AutoIncrement'

++
||
++
++

In [14]:
%%sql
SELECT *
FROM total_tracks_view

Running query in 'mysql://valenatherese:***@localhost/Chinook_AutoIncrement'

276 rows affected.

+--------------+-------------------------+
| Total_Tracks |          Artist         |
+--------------+-------------------------+
|     3503     |          Total          |
|     213      |       Iron Maiden       |
|     135      |            U2           |
|     114      |       Led Zeppelin      |
|     112      |        Metallica        |
|      92      |       Deep Purple       |
|      92      |           Lost          |
|      67      |        Pearl Jam        |
|      57      |      Lenny Kravitz      |
|      56      |     Various Artists     |
|      53      |        The Office       |
|      52      |      Faith No More      |
|      52      |        Van Halen        |
|      49      | Os Paralamas Do Sucesso |
|      48      |       Eric Clapton      |
+--------------+-------------------------+
Truncated to displaylimit of 15.

###### Comparing the number of unsold tracks versus total tracks per artist:

In [15]:
%%sql
SELECT Unsold_Tracks, total_tracks_view.Artist, Total_Tracks
FROM unsold_tracks_view
RIGHT JOIN total_tracks_view
ON unsold_tracks_view.Artist = total_tracks_view.Artist

Running query in 'mysql://valenatherese:***@localhost/Chinook_AutoIncrement'

276 rows affected.

+---------------+-------------------------+--------------+
| Unsold_Tracks |          Artist         | Total_Tracks |
+---------------+-------------------------+--------------+
|      1519     |          Total          |     3503     |
|       90      |       Iron Maiden       |     213      |
|       44      |            U2           |     135      |
|       37      |       Led Zeppelin      |     114      |
|       33      |        Metallica        |     112      |
|       51      |       Deep Purple       |      92      |
|       52      |           Lost          |      92      |
|       37      |        Pearl Jam        |      67      |
|       32      |      Lenny Kravitz      |      57      |
|       29      |     Various Artists     |      56      |
|       31      |        The Office       |      53      |
|       16      |      Faith No More      |      52      |
|       26      |        Van Halen        |      52      |
|       10      | Os Paralamas Do Sucesso |      49      |
|       13      |       Eric Clapton      |      48      |
+---------------+-------------------------+--------------+
Truncated to displaylimit of 15.

# QUARTERLY PERFORMANCE

### Individual Transactions, Daily Running Totals, Quarterly Performance

Break up the sales into four quarters a year. For each record in a quarter, show the running total and that records's quarterly total.

In [16]:
%config SqlMagic.displaylimit = 25

In [17]:
%%sql
SELECT  InvoiceId AS Tr_Id,
        CustomerId AS Cus_Id,
        DATE_FORMAT(InvoiceDate, '%M %e, %Y') AS Tr_Date,
        QUARTER(InvoiceDate) AS Qtr,
        Total AS Tr_Total,
        SUM(Total) OVER(PARTITION BY 
                        YEAR(InvoiceDate),
                        QUARTER(InvoiceDate)
                        ORDER BY InvoiceDate
                        ) AS Run_Total,
        SUM(Total) OVER(PARTITION BY 
                        YEAR(InvoiceDate),
                        QUARTER(InvoiceDate)
        ) AS Qtr_Total
FROM Invoice
ORDER BY InvoiceDate;

Running query in 'mysql://valenatherese:***@localhost/Chinook_AutoIncrement'

412 rows affected.

+-------+--------+-------------------+-----+----------+-----------+-----------+
| Tr_Id | Cus_Id |      Tr_Date      | Qtr | Tr_Total | Run_Total | Qtr_Total |
+-------+--------+-------------------+-----+----------+-----------+-----------+
|   1   |   2    |  January 1, 2021  |  1  |   1.98   |    1.98   |   110.88  |
|   2   |   4    |  January 2, 2021  |  1  |   3.96   |    5.94   |   110.88  |
|   3   |   8    |  January 3, 2021  |  1  |   5.94   |   11.88   |   110.88  |
|   4   |   14   |  January 6, 2021  |  1  |   8.91   |   20.79   |   110.88  |
|   5   |   23   |  January 11, 2021 |  1  |  13.86   |   34.65   |   110.88  |
|   6   |   37   |  January 19, 2021 |  1  |   0.99   |   35.64   |   110.88  |
|   7   |   38   |  February 1, 2021 |  1  |   1.98   |   39.60   |   110.88  |
|   8   |   40   |  February 1, 2021 |  1  |   1.98   |   39.60   |   110.88  |
|   9   |   42   |  February 2, 2021 |  1  |   3.96   |   43.56   |   110.88  |
|   10  |   46   |  February 3, 2021 |  1  |   5.94   |   49.50   |   110.88  |
|   11  |   52   |  February 6, 2021 |  1  |   8.91   |   58.41   |   110.88  |
|   12  |   2    | February 11, 2021 |  1  |  13.86   |   72.27   |   110.88  |
|   13  |   16   | February 19, 2021 |  1  |   0.99   |   73.26   |   110.88  |
|   14  |   17   |   March 4, 2021   |  1  |   1.98   |   77.22   |   110.88  |
|   15  |   19   |   March 4, 2021   |  1  |   1.98   |   77.22   |   110.88  |
|   16  |   21   |   March 5, 2021   |  1  |   3.96   |   81.18   |   110.88  |
|   17  |   25   |   March 6, 2021   |  1  |   5.94   |   87.12   |   110.88  |
|   18  |   31   |   March 9, 2021   |  1  |   8.91   |   96.03   |   110.88  |
|   19  |   40   |   March 14, 2021  |  1  |  13.86   |   109.89  |   110.88  |
|   20  |   54   |   March 22, 2021  |  1  |   0.99   |   110.88  |   110.88  |
|   21  |   55   |   April 4, 2021   |  2  |   1.98   |    3.96   |   112.86  |
|   22  |   57   |   April 4, 2021   |  2  |   1.98   |    3.96   |   112.86  |
|   23  |   59   |   April 5, 2021   |  2  |   3.96   |    7.92   |   112.86  |
|   24  |   4    |   April 6, 2021   |  2  |   5.94   |   13.86   |   112.86  |
|   25  |   10   |   April 9, 2021   |  2  |   8.91   |   22.77   |   112.86  |
+-------+--------+-------------------+-----+----------+-----------+-----------+
Truncated to displaylimit of 25.

In [18]:
%config SqlMagic.displaylimit = 15

### Individual Transactions and Their Customer Type By Quarter
Classify customers as regular or one time. Regular customers are those that have transacted more than once. One time customers are those that have only transacted once. This is further broken up into quarter and over the duration of the entire time. See the descriptions of the columns for more information:
* `Qtr_Cus_Tr` is the number of transactions that customer made in that quarter.
* `Cus_Qtr_Type` is regular if they purchased more than once in that quarter.
* `Cus_Type` is regular as long as the customer purchased more than once in the entire time covered.

In [19]:
%%sql
SELECT  InvoiceId AS Tr_Id,
        DATE_FORMAT(InvoiceDate, '%M %e, %Y') AS Tr_Date,
        QUARTER(InvoiceDate) AS Qtr,
        CustomerId AS Cus_Id, 
        Total AS Tr_Total,
        COUNT(CustomerId) OVER(PARTITION BY 
                CustomerId, 
                YEAR(InvoiceDate), 
                QUARTER(InvoiceDate)
        ) AS Qtr_Cus_Tr,
        CASE
            WHEN COUNT(CustomerId) OVER(PARTITION BY 
                CustomerId, 
                YEAR(InvoiceDate), 
                QUARTER(InvoiceDate)) > 1 THEN 'Regular'
            ELSE 'One time'
        END AS Cus_Qtr_Type,
        CASE
            WHEN COUNT(CustomerId) OVER(PARTITION BY 
                CustomerId) > 1 THEN 'Regular'
            ELSE 'One time'
        END AS Cus_Type     
FROM Invoice
ORDER BY InvoiceDate;

Running query in 'mysql://valenatherese:***@localhost/Chinook_AutoIncrement'

412 rows affected.

+-------+-------------------+-----+--------+----------+------------+--------------+----------+
| Tr_Id |      Tr_Date      | Qtr | Cus_Id | Tr_Total | Qtr_Cus_Tr | Cus_Qtr_Type | Cus_Type |
+-------+-------------------+-----+--------+----------+------------+--------------+----------+
|   1   |  January 1, 2021  |  1  |   2    |   1.98   |     2      |   Regular    | Regular  |
|   2   |  January 2, 2021  |  1  |   4    |   3.96   |     1      |   One time   | Regular  |
|   3   |  January 3, 2021  |  1  |   8    |   5.94   |     1      |   One time   | Regular  |
|   4   |  January 6, 2021  |  1  |   14   |   8.91   |     1      |   One time   | Regular  |
|   5   |  January 11, 2021 |  1  |   23   |  13.86   |     1      |   One time   | Regular  |
|   6   |  January 19, 2021 |  1  |   37   |   0.99   |     1      |   One time   | Regular  |
|   7   |  February 1, 2021 |  1  |   38   |   1.98   |     1      |   One time   | Regular  |
|   8   |  February 1, 2021 |  1  |   40   |   1.98   |     2      |   Regular    | Regular  |
|   9   |  February 2, 2021 |  1  |   42   |   3.96   |     1      |   One time   | Regular  |
|   10  |  February 3, 2021 |  1  |   46   |   5.94   |     1      |   One time   | Regular  |
|   11  |  February 6, 2021 |  1  |   52   |   8.91   |     1      |   One time   | Regular  |
|   12  | February 11, 2021 |  1  |   2    |  13.86   |     2      |   Regular    | Regular  |
|   13  | February 19, 2021 |  1  |   16   |   0.99   |     1      |   One time   | Regular  |
|   14  |   March 4, 2021   |  1  |   17   |   1.98   |     1      |   One time   | Regular  |
|   15  |   March 4, 2021   |  1  |   19   |   1.98   |     1      |   One time   | Regular  |
+-------+-------------------+-----+--------+----------+------------+--------------+----------+
Truncated to displaylimit of 15.

# MOST SOLD ARTIST

### All-Time Top Artist
Show the top artists. 
For each artist, also show the difference between that artist's number of sold tracks and the next artist's number of sold tracks. (Next artist in this case refers to the artist with the next highest number of sold tracks.)

Example: Iron Maiden sold 140 tracks and U2 sold 107 tracks. U2's record would show a 33 on its `Difference` column

In [20]:
%%sql
SELECT
    ar.Name AS Artist,
    COUNT(Il.TrackId) AS Tracks_Sold,
    ABS(COUNT(Il.TrackId) - LAG(COUNT(Il.TrackId)) 
        OVER(ORDER BY COUNT(Il.TrackId) DESC)) AS Difference
    
FROM Artist AS ar
LEFT JOIN Album Al
    ON Ar.ArtistId = Al.ArtistId
RIGHT JOIN Track t
    ON Al.AlbumId = t.AlbumId
LEFT JOIN InvoiceLine Il
    ON t.TrackId = Il.TrackId
    
GROUP BY ar.Name
ORDER BY Tracks_Sold DESC;

Running query in 'mysql://valenatherese:***@localhost/Chinook_AutoIncrement'

204 rows affected.

+------------------------------+-------------+------------+
|            Artist            | Tracks_Sold | Difference |
+------------------------------+-------------+------------+
|         Iron Maiden          |     140     |    None    |
|              U2              |     107     |     33     |
|          Metallica           |      91     |     16     |
|         Led Zeppelin         |      87     |     4      |
|   Os Paralamas Do Sucesso    |      45     |     42     |
|         Deep Purple          |      44     |     1      |
|        Faith No More         |      42     |     2      |
|             Lost             |      41     |     1      |
|         Eric Clapton         |      40     |     1      |
|            R.E.M.            |      39     |     1      |
|            Queen             |      37     |     2      |
| Creedence Clearwater Revival |      37     |     0      |
|        Guns N' Roses         |      36     |     1      |
|            Titãs             |      34     |     2      |
|          Green Day           |      33     |     1      |
+------------------------------+-------------+------------+
Truncated to displaylimit of 15.

### Yearly Top Artist

Show the top artist for each year based on number of tracks sold

In [21]:
%%sql
CREATE VIEW YEARLY_TOP AS
SELECT
    YEAR(InvoiceDate) AS Year,
    ar.Name AS Artist,
    COUNT(il.TrackId) AS Tracks_Sold
    
    
FROM Artist AS ar
LEFT JOIN Album Al
    ON Ar.ArtistId = Al.ArtistId
RIGHT JOIN Track t
    ON Al.AlbumId = t.AlbumId
LEFT JOIN InvoiceLine il
    ON t.TrackId = il.TrackId
RIGHT JOIN Invoice i
    ON Il.InvoiceId = i.InvoiceId
    
GROUP BY Year, Artist 
ORDER BY Year;

Running query in 'mysql://valenatherese:***@localhost/Chinook_AutoIncrement'

++
||
++
++

In [22]:
%%sql
SELECT  Year,
        Artist,
        Tracks_Sold       
FROM YEARLY_TOP
WHERE Tracks_Sold IN (SELECT MAX(Tracks_Sold)
                     OVER(PARTITION BY YEAR) AS YEARLY_TOP_ARTIST
                     FROM YEARLY_TOP
                     )
GROUP BY Artist, Year;

Running query in 'mysql://valenatherese:***@localhost/Chinook_AutoIncrement'

6 rows affected.

+------+-------------+-------------+
| Year |    Artist   | Tracks_Sold |
+------+-------------+-------------+
| 2021 | Iron Maiden |      34     |
| 2022 | Iron Maiden |      35     |
| 2022 |      U2     |      27     |
| 2023 |      U2     |      27     |
| 2024 | Iron Maiden |      34     |
| 2025 | Iron Maiden |      36     |
+------+-------------+-------------+

# FEATURING ARTISTS

### Separating Artist Names into Main and Featuring Artists
Context: Some artists in the `Artist` table have featured artists. The featured artists are lumped together with the main artist in one column. This makes it difficult to programmatically distinguish the main artist from the featured artists in the `Artist` table and analyze the main artists' track performances.

Objective: Separate the main artist from the featured artists into separate columns.

In [23]:
%%sql
SELECT *, 
        CASE
            WHEN Name LIKE BINARY '%Feat%'
                THEN SUBSTRING_INDEX(Name, 'Feat', 1)
            WHEN Name LIKE BINARY '%feat%'
                THEN SUBSTRING_INDEX(Name, 'feat', 1)
        ELSE Name
        END AS Main_Artist,
        CASE
            WHEN Name LIKE BINARY '%Featuring%'
                THEN SUBSTRING_INDEX(Name, 'Featuring', -1)
            WHEN Name LIKE BINARY '%featuring%'
                THEN SUBSTRING_INDEX(Name, 'featuring', -1)
            WHEN Name LIKE '%feat%'
                THEN SUBSTRING_INDEX(Name, 'Feat.', -1)
            ELSE 'None'
        END AS Featuring_Artist
FROM Artist
WHERE Name LIKE '%feat%';

Running query in 'mysql://valenatherese:***@localhost/Chinook_AutoIncrement'

12 rows affected.

+----------+------------------------------------------------------+------------------------------+-----------------------+
| ArtistId |                         Name                         |         Main_Artist          |    Featuring_Artist   |
+----------+------------------------------------------------------+------------------------------+-----------------------+
|    49    | Edson, DJ Marky & DJ Patife Featuring Fernanda Porto | Edson, DJ Marky & DJ Patife  |     Fernanda Porto    |
|    60    |             Santana Feat. Dave Matthews              |           Santana            |      Dave Matthews    |
|    61    |                Santana Feat. Everlast                |           Santana            |        Everlast       |
|    62    |               Santana Feat. Rob Thomas               |           Santana            |       Rob Thomas      |
|    63    |          Santana Feat. Lauryn Hill & Cee-Lo          |           Santana            |  Lauryn Hill & Cee-Lo |
|    64    |            Santana Feat. The Project G&B             |           Santana            |     The Project G&B   |
|    65    |                  Santana Feat. Maná                  |           Santana            |          Maná         |
|    66    |            Santana Feat. Eagle-Eye Cherry            |           Santana            |    Eagle-Eye Cherry   |
|    67    |              Santana Feat. Eric Clapton              |           Santana            |      Eric Clapton     |
|   122    |              R.E.M. Feat. Kate Pearson               |           R.E.M.             |      Kate Pearson     |
|   123    |                 R.E.M. Feat. KRS-One                 |           R.E.M.             |         KRS-One       |
|   160    |         Christina Aguilera featuring BigElf          |     Christina Aguilera       |         BigElf        |
+----------+------------------------------------------------------+------------------------------+-----------------------+

Note: The above applies for all artists with featuring artists in their `Name` , regardless of if they have tracks or not connected to that `ArtistId`.

### Adding the Featured Artist's Name to the Track Title

In [24]:
%%sql
SELECT  ar.ArtistId,
        ar.Name AS Artist,
        t.TrackId, 
        CASE
            WHEN ar.Name LIKE BINARY '%Feat%'
                THEN SUBSTRING_INDEX(ar.Name, 'Feat', 1)
            WHEN ar.Name LIKE BINARY '%feat%'
                THEN SUBSTRING_INDEX(ar.Name, 'feat', 1)
        ELSE ar.Name
        END AS Main_Artist,
        CASE
            WHEN ar.Name LIKE BINARY '%Featuring%'
                THEN SUBSTRING_INDEX(ar.Name, 'Featuring', -1)
            WHEN ar.Name LIKE BINARY '%featuring%'
                THEN SUBSTRING_INDEX(ar.Name, 'featuring', -1)
            WHEN ar.Name LIKE '%feat%'
                THEN SUBSTRING_INDEX(ar.Name, 'Feat.', -1)
            ELSE 'None'
        END AS Featuring_Artist,
        t.Name AS Old_Title,
        CONCAT_WS(' ', t.Name, 'Featuring', SUBSTRING_INDEX(ar.Name, 'Feat.', -1 )) AS 'New_Title'
        
FROM Artist ar
JOIN Album Al
    ON Ar.ArtistId = Al.ArtistId
JOIN Track t
    ON Al.AlbumId = t.AlbumId 
WHERE ar.Name LIKE '%feat%';

Running query in 'mysql://valenatherese:***@localhost/Chinook_AutoIncrement'

11 rows affected.

+----------+---------------------------+---------+-------------+------------------+--------------------+--------------------------------------------+
| ArtistId |           Artist          | TrackId | Main_Artist | Featuring_Artist |     Old_Title      |                 New_Title                  |
+----------+---------------------------+---------+-------------+------------------+--------------------+--------------------------------------------+
|   122    | R.E.M. Feat. Kate Pearson |   2282  |   R.E.M.    |   Kate Pearson   | Shiny Happy People | Shiny Happy People Featuring  Kate Pearson |
|   122    | R.E.M. Feat. Kate Pearson |   2283  |   R.E.M.    |   Kate Pearson   |    Me In Honey     |    Me In Honey Featuring  Kate Pearson     |
|   122    | R.E.M. Feat. Kate Pearson |   2284  |   R.E.M.    |   Kate Pearson   |     Radio Song     |     Radio Song Featuring  Kate Pearson     |
|   122    | R.E.M. Feat. Kate Pearson |   2310  |   R.E.M.    |   Kate Pearson   | Losing My Religion | Losing My Religion Featuring  Kate Pearson |
|   122    | R.E.M. Feat. Kate Pearson |   2311  |   R.E.M.    |   Kate Pearson   |        Low         |        Low Featuring  Kate Pearson         |
|   122    | R.E.M. Feat. Kate Pearson |   2312  |   R.E.M.    |   Kate Pearson   |  Near Wild Heaven  |  Near Wild Heaven Featuring  Kate Pearson  |
|   122    | R.E.M. Feat. Kate Pearson |   2313  |   R.E.M.    |   Kate Pearson   |      Endgame       |      Endgame Featuring  Kate Pearson       |
|   122    | R.E.M. Feat. Kate Pearson |   2314  |   R.E.M.    |   Kate Pearson   |       Belong       |       Belong Featuring  Kate Pearson       |
|   122    | R.E.M. Feat. Kate Pearson |   2315  |   R.E.M.    |   Kate Pearson   | Half A World Away  | Half A World Away Featuring  Kate Pearson  |
|   122    | R.E.M. Feat. Kate Pearson |   2316  |   R.E.M.    |   Kate Pearson   |     Texarkana      |     Texarkana Featuring  Kate Pearson      |
|   122    | R.E.M. Feat. Kate Pearson |   2317  |   R.E.M.    |   Kate Pearson   |  Country Feedback  |  Country Feedback Featuring  Kate Pearson  |
+----------+---------------------------+---------+-------------+------------------+--------------------+--------------------------------------------+

Note: The above only applies for artists with available tracks (`TrackId` connected to the `ArtistId` wherein the artist's `Name` has a featuring.